<?php

return [
    0 => "success",   // 默认
    1 => "false",
    2 => "传入参数格式不对",

    /*
    |--------------------------------------------------------------------------
    | 系统错误码
    |--------------------------------------------------------------------------
    |
    */
    101 => '用户未注册',
    102 => '用户未登录',
    103 => '当前用户名已存在',
    104 => '当前用户没有绑定手机',

    // HTTP 客户端请求
    304 => 'HTTP缓存有效',
    400 => '请求格式错误',
    401 => '未授权',
    403 => '请求成功，但是该用户没有权限',
    404 => '请求的资源不存在',
    405 => '该http方法不被允许',
    410 => '这个url对应的资源现在不可用',
    415 => '请求类型错误',
    422 => '校验错误时用',
    429 => '请求过多',

    // Server Error 5xx
    500 => 'Internal Server Error',
    501 => 'Not Implemented',
    502 => 'Bad Gateway',
    503 => 'Service Unavailable',
    504 => 'Gateway Timeout',
    505 => 'HTTP Version Not Supported',
    509 => 'Bandwidth Limit Exceeded',


    /*
    |--------------------------------------------------------------------------
    | 业务错误码
    |--------------------------------------------------------------------------
    |
    */
    10000 => "ID无效",
    10001 => '无效的参数数据',
    
    // 购物车相关错误码
    50000 => '商品sku_id不存在',
    50001 => '数据格式不正确',
    50002 => '数据有误',

    // 订单相关
    60101 => '订单ID不存在',
    60102 => '订单编号不存在',
    60103 => '订单不存在',
    60104 => '订单已拆单到供应商',
    60105 => '订单商品不存在',

    60106 => '只有未支付的订单才能撤单',
    60107 => '只有已支付未发货的订单才能退单',
    60108 => '只有已完成的订单才能删除',
    60109 => '订单******',

    60200 => '只有未支付的订单才能撤单',
    60201 => '不是待支付订单',
    60202 => '支付金额为零',

];